src/cf/Documents/ДобавлениеАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ДобавлениеАналогов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АналогиПрепаратов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокАналогов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьОшибка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокАналоговЗеркальный</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приоритеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/АналогиПрепаратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналогиПрепаратов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Препарат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ДобавлениеАналогов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр АналогиПрепаратов
	Движения.АналогиПрепаратов.Записывать = Истина; 
	//СписокАналоговДляЗаписи = ПодготовитьТзДляЗаписи();
	Для Каждого Строка Из СписокАналогов Цикл
		Движение = Движения.АналогиПрепаратов.Добавить();
		Движение.Препарат = Строка.Препарат;
		Движение.Аналог = Строка.Аналог;
		//	Движение.Приоритет = ТекСтрокаСписокПрепаратов.Приоритет;
		//ЗаполнитьЗначенияСвойств(Движение,Строка);
	КонецЦикла; 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 
	
Функция ПодготовитьТзДляЗаписи()
	
	//ТЗ_СписокАналогов = СписокАналогов.Выгрузить(); 
	//Для Каждого Строка Из СписокАналогов Цикл
	//	НоваяСтрока = ТЗ_СписокАналогов.Добавить();
	//	НоваяСтрока.Препарат = Строка.Аналог;
	//	НоваяСтрока.Аналог = Строка.Препарат;
	//КонецЦикла;  
	//ТЗ_СписокАналогов.Сортировать("Препарат Возр");
	//
	//Возврат ТЗ_СписокАналогов;
	
КонецФункции
